Ran Plan for dir: `S3/atlantis-test-bucket` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_s3_bucket.test will be created
+ resource "aws_s3_bucket" "test" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "test-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/s3/test-bucket"
          + "environment" = "dev"
          + "name"        = "atlantis-test-bucket"
        }
      + tags_all                    = {
          + "Attributes"  = "s3-bucket"
          + "ManagedBy"   = "terraform"
          + "Owner"       = "team-infrastructure"
          + "TFProject"   = "github.com/tampubolon/s3/test-bucket"
          + "environment" = "dev"
          + "name"        = "atlantis-test-bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ bucket_arn = (known after apply)
+ bucket_id  = (known after apply)
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d S3/atlantis-test-bucket
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://dc5f6fc9bf6e:4141/lock?id=tampubolon%252Fdata-pipeline%252FS3%252Fatlantis-test-bucket%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d S3/atlantis-test-bucket
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```